qwen3.6-27b/fp8/H_office-baseline.log
/usr/local/lib/python3.12/dist-packages/torch/cuda/__init__.py:1061: UserWarning: Can't initialize NVML
  raw_cnt = _raw_device_count_nvml()
W0504 14:17:24.695000 602 torch/utils/cpp_extension.py:140] No CUDA runtime is found, using CUDA_HOME='/usr/local/cuda'
INFO 05-04 14:17:25 [main.py:49] Unspecified platform detected, switching to CPU Platform instead.
/usr/local/lib/python3.12/dist-packages/torch/cuda/__init__.py:1061: UserWarning: Can't initialize NVML
  raw_cnt = _raw_device_count_nvml()
INFO 05-04 14:17:25 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 05-04 14:17:25 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
INFO 05-04 14:17:25 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-04 14:17:25 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xec1b838dab60>, trust_remote_code=False, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4000, random_output_len=500, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='Qwen/Qwen3.6-27B-FP8', input_len=None, output_len=None, tokenizer='Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.3, burstiness=0.7, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='H_office-baseline.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-09f6775a-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3.6-27b-fp8', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 05-04 14:17:27 [utils.py:90] Sampling input_len from [399, 7600] and output_len from [49, 950]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.3
Burstiness factor: 0.7 (Gamma distribution)
Maximum request concurrency: None
100%|██████████| 200/200 [16:10<00:00,  4.85s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           0.30      
Benchmark duration (s):                  970.71    
Total input tokens:                      814812    
Total generated tokens:                  97092     
Request throughput (req/s):              0.21      
Output token throughput (tok/s):         100.02    
Peak output token throughput (tok/s):    453.00    
Peak concurrent requests:                160.00    
Total token throughput (tok/s):          939.42    
---------------Time to First Token----------------
Mean TTFT (ms):                          20745.87  
Median TTFT (ms):                        14093.10  
P50 TTFT (ms):                           14093.10  
P90 TTFT (ms):                           49588.83  
P95 TTFT (ms):                           55909.65  
P99 TTFT (ms):                           74180.36  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          932.64    
Median TPOT (ms):                        949.89    
P50 TPOT (ms):                           949.89    
P90 TPOT (ms):                           1403.12   
P95 TPOT (ms):                           1535.78   
P99 TPOT (ms):                           1852.86   
---------------Inter-token Latency----------------
Mean ITL (ms):                           833.74    
Median ITL (ms):                         425.55    
P50 ITL (ms):                            425.55    
P90 ITL (ms):                            1952.42   
P95 ITL (ms):                            2053.38   
P99 ITL (ms):                            2134.51   
----------------End-to-end Latency----------------
Mean E2EL (ms):                          423404.39 
Median E2EL (ms):                        421694.05 
P50 E2EL (ms):                           421694.05 
P90 E2EL (ms):                           696044.43 
P95 E2EL (ms):                           759968.71 
P99 E2EL (ms):                           803971.28 
==================================================